/* Практическое задание 5.
   Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами.
   Напишите программу, которая покажет количество чётных чисел в массиве. */

Console.WriteLine("Hello, World!");
