/* Семинар 2.
   Задача 1: Напишите программу, которая выводит случайное
   трёхзначное число и удаляет вторую цифру этого числа. */

Console.WriteLine("Hello, World!");
