/*  Практическое задание 9.
    Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N. */

Console.WriteLine("Hello, World!");
