/* Практическое задание 2.
   Задача 13: Напишите программу, которая выводит третью цифру
   заданного числа или сообщает, что третьей цифры нет. */

Console.WriteLine("Hello, World!");
