/* Семинар 2.
   Задача 2: Напишите программу, которая выводит случайное число
   из отрезка [10, 99] и показывает наибольшую цифру числа. */

Console.WriteLine("Hello, World!");
