/* Практическое задание 5.
   Задача 36: Задайте одномерный массив, заполненный случайными числами.
   Найдите сумму элементов, стоящих на нечётных позициях. */

Console.WriteLine("Hello, World!");
