/* Семинар 2.
   Задача 3: Напишите программу, которая будет принимать на вход два числа
   и выводить, является ли второе число кратным первому. */

Console.WriteLine("Hello, World!");
