/* Семинар 2.
   Задача 4: Напишите программу, которая принимает на вход два числа
   и проверяет, является ли одно число квадратом другого. */

Console.WriteLine("Hello, World!");
