/* Практическое задание 7.
   Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце. */

Console.WriteLine("Hello, World!");
