/* Практическое задание 4.
   Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе. */

Console.WriteLine("Hello, World!");
