/*  Практическое задание 9.
    Задача 64: Задайте значение N. Напишите программу, которая выведет
    все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
    (Переделка из Задайте значения M и N. Напишите программу, которая выведет
    все натуральные числа в промежутке от M до N.) */

Console.WriteLine("Hello, World!");
