/* Практическое задание 4.
   Задача 29: Напишите программу, которая задаёт массив из m элементов и выводит их на экран. */

Console.WriteLine("Hello, World!");
