/*  Практическое задание 8.
    Задача 60. Сформируйте трёхмерный массив из неповторяющихся двузначных чисел.
    Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента. */

Console.WriteLine("Hello, World!");
