/*  Практическое задание 8.
    Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4. */

Console.WriteLine("Hello, World!");
